---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExportDGNSettings..::..Create Method
ExportDGNSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, String) | Create a DGN export settings with default values. |
|  | Create(Document, String, DGNExportOptions) | Create DGN export settings with specified values in DGNExportOptions. |

# See Also

ExportDGNSettings Class

ExportDGNSettings Members

Autodesk.Revit.DB Namespace